[
    {
      "id": 1,
      "name": "Blog Website",
      "image": "https://i.ibb.co.com/J28gsmp/long-term-travel.jpg",
      "description": "A blog website is an online platform where individuals or organizations regularly share articles, opinions, blog posts are organized or updates on various topics.",
      "technologies" : ["React", "Node.js", "MongoDB", "Express", "JWT"],
      "challenge" : "Blog website that highlights personal stories of individuals who have faced and overcome significant challenges in their lives.",
      "progress" : "Modern, Clean Layout Updating the websites design to be more visually appealing and easy to navigate. This may include responsive design for mobile and tablet users.",
      "liveLink" : "https://my-assignment-11-73142.web.app",
      "githubLink" : "https://github.com/programming-hero-web-course2/b10a11-client-side-muradhossain1"
    },
    {
      "id": 2,
      "name": "Chill Gamer project",
      "image": "https://i.ibb.co.com/Yy14mDF/red-dead-redemption-2.jpg",
      "description": "Chill Gamer is a project aimed at creating a relaxed and friendly gaming community. It focuses on providing a space for gamers to enjoy their favorite games. ",
      "technologies" : ["React", "Node.js", "MongoDB", "Express", "JWT"],
      "challenge" : "It offers a space for gamers to share their stories of perseverance, highlight how gaming has helped them cope or build resilience, and inspire others to face challenges head-on.",
      "progress" : "Game Reviews and Recommendations Regularly post game reviews, walkthroughs, and recommendations for casual gaming experiences, encouraging users to try new titles.",
      "liveLink" : "https://my-assignment-10-4d054.web.app",
      "githubLink" : "https://github.com/programming-hero-web-course2/b10-a10-client-side-muradhossain1"
    },
    {
      "id": 3,
      "name": "Coupon Collecting Project",
      "image": "https://i.ibb.co.com/7JM8hZH/decoration.jpg",
      "description": "The Coupon Collecting Project is a fun and engaging initiative that revolves around collecting and exchanging coupons, often tied to discounts, rewards, or special offers.",
      "technologies" : ["React", "Node.js", "MongoDB", "Express", "JWT"],
      "challenge" : " Coupon Collecting is a website that blends the thrill of saving with personal growth. This platform invites users to share their experiences of facing challenges while collecting coupons, discounts, and special offers.",
      "progress" : "Trending and Popular Coupons Feature a section that highlights trending, highly-rated, or most-used coupons to help users discover the best deals quickly.",
      "liveLink" : "https://my-assignment-9-2f295.web.app",
      "githubLink" : "https://github.com/programming-hero-web-course1/b10-a9-authentication-muradhossain1"
    }
  ]